Revit 2027 API
StoneBumpType Enumeration
 The enumerated type representing the permitted values for the asset property "StoneBump" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StoneBumpType
Public Enumeration StoneBumpType
public enum class StoneBumpType
type StoneBumpType
Members
Member name | Value | Description
Custom | 4
Glossymarble | 3
None | 0
Polishedgranite | 1
Stonewall | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace